
#+PROPERTY: header-args:jupyter-python :kernel PROMICE_dev :session hacking :exports both
#+PROPERTY: header-args:bash :exports both

* Table of contents                               :toc_3:noexport:
- [[#development-environments][Development Environment(s)]]
  - [[#python][Python]]
  - [[#gdl][GDL]]
  - [[#idl][IDL]]
- [[#examples-of-processed-data][Examples of processed data]]
  - [[#python-1][Python]]
  - [[#idlgdl][IDL/GDL]]
- [[#debugging][Debugging]]
  - [[#examining-and-comparing-idl-and-python-variables-internally][Examining and comparing IDL and Python variables internally]]
  - [[#comparing-python-vs-idl-or-gdl][Comparing Python vs (IDL or GDL)]]
  - [[#comparing-gdl-vs-idl-or-gdl][Comparing GDL vs. (IDL or GDL)]]
- [[#misc][Misc]]
  - [[#metadatacsv-to-toml][metadata.csv to TOML]]

* Development Environment(s)
** TODO Python

Set up development environment

#+BEGIN_SRC bash :results verbatim :exports both
conda create -n PROMICE_dev python=3.6 numpy pandas scipy bottleneck xarray netcdf4 toml
conda activate PROMICE_dev

# OR

conda create -n PROMICE_dev python=3.6
conda activate PROMICE_dev
python -m pip install --upgrade git+http://github.com/GEUS-Glaciology-and-Climate/PROMICE-AWS-processing.git
#+END_SRC

Run the dev version without installing:

#+BEGIN_SRC bash
PYTHONPATH=./src python ./bin/promiceAWS --config_file=./test_data/conf/KPC_L.toml -i ./test_data/input -o ./test_data/output_py
#+END_SRC

Install the dev version locally:

#+BEGIN_SRC bash
make build # or: python3 -m build
make install # or: python3 -m pip install --upgrade .
# now, run 'promiceAWS' more simply: promiceAWS -c /path/to/conf.toml -i /path/to/input -o /path/to/output
#+END_SRC

** GDL

#+BEGIN_SRC bash :results verbatim :exports both
gdl --version
#+END_SRC

#+RESULTS:
: GDL - GNU Data Language, Version 0.9.9


** IDL

???

* Examples of processed data

** Python

#+BEGIN_SRC bash :results verbatim :exports both
PYTHONPATH=./src python ./bin/promiceAWS --config_file=./test_data/conf/KPC_L.toml -i ./test_data/input -o ./test_data/output_py
find ./test_data/output_py
#+END_SRC

#+RESULTS:
: ./test_data/output_py
: ./test_data/output_py/KPC_L
: ./test_data/output_py/KPC_L/KPC_L_day.nc
: ./test_data/output_py/KPC_L/KPC_L_hour.nc
: ./test_data/output_py/KPC_L/KPC_L_hour.csv
: ./test_data/output_py/KPC_L/KPC_L_day.csv

** IDL/GDL

+ Note :: To compare IDL and GDL, change the =./output_GDL/= to =./output_IDL=

#+BEGIN_SRC bash :results verbatim :exports both
cd test_data
gdl -e awsdataprocessing_gdl_v3 -args infolder=./input/ outfolder=./output_GDL/ metadata=./metadata/KPC_L_metadata_TX.csv station=KPC_L
#+END_SRC

#+RESULTS:
#+begin_example
% Compiled module: AWSDATAPROCESSING_GDL_V3.
AWS             STRING    = 'KPC_L'
INFOLDER        STRING    = './input/'
OUTFOLDER       STRING    = './output_GDL/'
METADATAFILE    STRING    = './metadata/KPC_L_metadata_TX.csv'
File: KPC_L_2019_raw_transmitted.txt
Date and time: 2019/ 7/ 12 16: 0
% Compiled module: INTERPOL.
% Compiled module: FINDEX.
- Sun in view of upper sensor / workable albedos:        3297          26%
- Sun below horizon:        2861          22%
- Sun in view of lower sensor:         120           0%
- Spikes removed using TOA criteria:        3043          24%
- Mean net SR change by corrections:     -34.1017 W/m2
total_lines:        12557
Done with this station. Run time (minutes) =       0.23001783
-----------------------------------------------------------
#+end_example



* Debugging

** Examining and comparing IDL and Python variables internally

Somewhere in the IDL or GDL code:
#+BEGIN_SRC IDL :exports both
save, var1, var2, varN, filename='debug.sav'
stop # optional
#+END_SRC

Somewhere in a Python file:
#+BEGIN_SRC python :exports both

# read in the IDL variables
from scipy.io import readsav
idl = readsav('debug.sav')

# Drop to an interactive IPython debugger
from IPython import embed; embed()
#+END_SRC
#+RESULTS:


** Comparing Python vs (IDL or GDL)

The following code,
+ loads two output files (one IDL-generated, on Python-generated)
+ Renames columns so they match between the two products
+ Computes the absolute and % error for each variable
+ Prints a table of mean, standard deviation, and maximum errors for each variable
+ Plots one of the variables from each file for visual examination

#+BEGIN_SRC jupyter-python :exports: both :kernel ds
import numpy as np
import pandas as pd

station='KPC_L'

pd.options.display.float_format = "{:,.5f}".format

# Parse IDL/GDL date time columns
def mydf(y,m,d,h): return pd.to_datetime(y+'-'+m+'-'+d+':'+h, format='%Y-%m-%d:%H')

gdl2py_col = pd.read_csv('variables.csv')[['field','IDL']].set_index('IDL').dropna().to_dict()['field']

gdl = pd.read_csv("./test_data/output/"+station+"_hour_v03.txt",
                  delimiter="\s+", parse_dates={'time':[0,1,2,3]},
                  infer_datetime_format=True, date_parser=mydf, index_col=0)\
        .apply(pd.to_numeric, errors='coerce')\
        .rename(columns=gdl2py_col)

df = pd.read_csv("./test_data/output_py/"+station+"/"+station+"_hour.csv", index_col=0, parse_dates=True)

subset = np.intersect1d(df.columns, gdl.columns)
print('Common columns: ', sorted(subset), '\n')
print('GDL columns dropped:', sorted([_ for _ in gdl.columns if _ not in subset]), '\n')
print('Python columns dropped:', sorted([_ for _ in df.columns if _ not in subset]), '\n')

df = df[subset]
gdl = gdl[subset]

# drop -999s from stats and err graphic
err = df - gdl.replace(-999,np.nan) # need to understand data to understand error
err_pct = (err / gdl.replace(-999,np.nan).mean(axis='rows'))*100 # % err but should work as long as mean != 0

err_desc = err.abs().describe().T.drop(columns=['count','min','25%','50%','75%'])
err_pct_desc = err_pct.abs().describe().T.drop(columns=['count','min','25%','50%','75%'])

# diff_pct.plot()
# diff_pct.replace(0,np.nan).dropna(how='all', axis='columns').plot()
def plot_diff(df,gdl,err,err_pct,var):
    import matplotlib.pyplot as plt
    fig = plt.figure(1)
    fig.clf()
    ax1 = fig.add_subplot(211)
    err[var].plot(label='err', color='red', marker='.', ax=ax1, linewidth=2)
    ax1.set_ylim(ax1.get_ylim()[0]*1.3, ax1.get_ylim()[1])
    ax1.set_ylabel("Err [units]")
    ax1_pct = ax1.twinx()
    err_pct[var].plot(label='err', color='black', marker='.', ax=ax1_pct, linewidth=0.5)
    ax1_pct.set_ylabel("Err [%]")
    ax1.tick_params(axis='y', colors='red')
    ax1.yaxis.label.set_color('red')
    ax1.title.set_color('red')
    
    ax2 = fig.add_subplot(212, sharex=ax1)
    gdl[var].replace(-999,np.nan).plot(label='GDL '+var, linewidth=3, ax=ax2, marker='.', markersize=4)
    df[var].plot(label='Py '+var, ax=ax2, marker='.', markersize=3)
    ax2.set_ylabel(var + " [units]")
    legend()


# ISSUES: dshf, dsr_cor, usr_cor, z_pt_cor
var = 'albedo' # 1 point error, otherwise PERFECT
var = 'batt_v' # PERFECT except GAPS
var = 'cc' # FEW points: > 10 %; GAPS
var = 'dlhf' # GAPS; 100 % error @ 10 units
var = 'dlr' # GAPS; <5 % error at 10 units
var = 'dshf' # GAPS; 100 % error at 40
var = 'dsr' # GAPS
var = 'dsr_cor' # 1 point error. GAPS
var = 'fan_dc' # GAPS; PERFECT
var = 'gps_alt' # GAPS; PERFECT
var = 'p' # GAPS; PERFECT
var = 'qh'# GAPS; PERFECT
var = 'rh_cor' # GAPS; PERFECT
var = 't_1'
var = 't_2'
var = 't_i_1'
var = 't_i_8'
var = 't_log'
# var = 't_surf' # error
var = 'tilt_x'
var = 'tilt_y'
var = 'ulr' # disagree but OK
var = 'usr' # 3 % when units 6
var = 'usr_cor' # 1 big error
var = 'wdir' # GAP; PERFECT
var = 'wspd' # GAP; PERFECT
var = 'z_boom' # GAP
var = 'z_pt' # GAP
var = 'z_pt_cor' # GAP
var = 'z_stake' # GAP

plot_diff(df,gdl,err,err_pct,var)

desc = err_desc.round(3).astype("string")
desc = desc + " (" + err_pct_desc.replace(np.nan,0).round().astype(int).astype("string") + ")"
desc
#+END_SRC

#+RESULTS:
:RESULTS:
: Common columns:  ['albedo', 'batt_v', 'cc', 'dlhf', 'dlr', 'dshf', 'dsr', 'dsr_cor', 'fan_dc', 'gps_alt', 'gps_hdop', 'gps_lat', 'gps_lon', 'gps_time', 'p', 'qh', 'rh_cor', 't_1', 't_2', 't_i_1', 't_i_2', 't_i_3', 't_i_4', 't_i_5', 't_i_6', 't_i_7', 't_i_8', 't_log', 't_surf', 'tilt_x', 'tilt_y', 'ulr', 'usr', 'usr_cor', 'wdir', 'wspd', 'z_boom', 'z_pt', 'z_pt_cor', 'z_stake'] 
: 
: GDL columns dropped: ['DayOfCentury', 'DayOfYear'] 
: 
: Python columns dropped: ['SKIP_1', 'alt', 'batt_v_ini', 'batt_v_ss', 'freq_vw', 'gps_geoid', 'gps_numsat', 'gps_q', 'lat', 'lon', 'n', 'precip', 'rh', 'rot', 't_rad', 'wd_std', 'wdir_std', 'wspd_x', 'wspd_y', 'z_boom_ice', 'z_boom_q', 'z_ice', 'z_snow', 'z_stake_q', 'z_surf'] 
: 
|          | mean         | std        | max            |
|----------+--------------+------------+----------------|
| albedo   | 0.0 (0)      | 0.005 (1)  | 0.452 (85)     |
| batt_v   | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| cc       | 0.002 (1)    | 0.002 (0)  | 0.118 (28)     |
| dlhf     | 0.052 (1)    | 0.418 (5)  | 25.854 (337)   |
| dlr      | 0.029 (0)    | 0.11 (0)   | 10.999 (5)     |
| dshf     | 0.113 (0)    | 1.048 (4)  | 54.185 (201)   |
| dsr      | 0.025 (0)    | 0.014 (0)  | 0.05 (0)       |
| dsr_cor  | 0.178 (0)    | 7.253 (5)  | 1007.54 (722)  |
| fan_dc   | 0.022 (0)    | 0.017 (0)  | 0.05 (0)       |
| gps_alt  | 0.0 (0)      | 0.006 (0)  | 1.083 (0)      |
| gps_hdop | 0.0 (0)      | 0.001 (0)  | 0.133 (18)     |
| gps_lat  | 0.0 (0)      | 0.0 (0)    | 0.0 (0)        |
| gps_lon  | 48.164 (200) | 0.002 (0)  | 48.166 (200)   |
| gps_time | 0.15 (0)     | 23.069 (0) | 3834.167 (6)   |
| p        | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| qh       | 0.002 (0)    | 0.001 (0)  | 0.005 (0)      |
| rh_cor   | 0.024 (0)    | 0.015 (0)  | 0.05 (0)       |
| t_1      | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_2      | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_i_1    | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_i_2    | 0.002 (0)    | 0.001 (0)  | 0.005 (0)      |
| t_i_3    | 0.002 (0)    | 0.001 (0)  | 0.005 (0)      |
| t_i_4    | 0.002 (0)    | 0.001 (0)  | 0.005 (0)      |
| t_i_5    | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_i_6    | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_i_7    | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_i_8    | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| t_log    | 0.003 (0)    | 0.001 (0)  | 0.005 (0)      |
| t_surf   | 0.005 (0)    | 0.028 (0)  | 1.686 (13)     |
| tilt_x   | 0.006 (1)    | 0.01 (1)   | 0.736 (83)     |
| tilt_y   | 0.005 (0)    | 0.009 (1)  | 0.498 (43)     |
| ulr      | 0.032 (0)    | 0.107 (0)  | 7.214 (3)      |
| usr      | 0.025 (0)    | 0.015 (0)  | 0.05 (0)       |
| usr_cor  | 0.105 (0)    | 6.149 (8)  | 855.498 (1121) |
| wdir     | 0.021 (0)    | 0.016 (0)  | 0.05 (0)       |
| wspd     | 0.002 (0)    | 0.002 (0)  | 0.005 (0)      |
| z_boom   | 0.0 (0)      | 0.0 (0)    | 0.001 (0)      |
| z_pt     | 0.0 (0)      | 0.0 (0)    | 0.001 (0)      |
| z_pt_cor | 0.0 (0)      | 0.0 (0)    | 0.001 (0)      |
| z_stake  | 0.0 (0)      | 0.0 (0)    | 0.001 (0)      |
:END:



** Comparing GDL vs. (IDL or GDL)

The following code,
+ loads two output files
+ Computes the absolute and % error for each variable
+ Prints a table of mean and maximum errors for each variable
+ Plots one of the variables from each file for visual examination

#+BEGIN_SRC jupyter-python :exports: both :kernel ds
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

station='KPC_L'

pd.options.display.float_format = "{:,.5f}".format

# Parse IDL date and time columns
def mydf(y,m,d,h): return pd.to_datetime(y+'-'+m+'-'+d+':'+h, format='%Y-%m-%d:%H')

idl = pd.read_csv("./test_data/output_IDL/"+station+"_hour_v03.txt",
                  delimiter="\s+", parse_dates={'time':[0,1,2,3]},
                  infer_datetime_format=True, date_parser=mydf, index_col=0)
gdl = pd.read_csv("./test_data/output_GDL/"+station+"_hour_v03.txt",
                  delimiter="\s+", parse_dates={'time':[0,1,2,3]},
                  infer_datetime_format=True, date_parser=mydf, index_col=0)

# idx = idl.index.intersection(gdl.index)
# idl = idl.loc[idx]
# gdl = gdl.loc[idx]


# first point often disagrees?
# idl = idl.iloc[1:]

err = idl - gdl
err_pct = (err / gdl.mean(axis='rows'))*100

err_desc = err.abs().describe().T.drop(columns=['count','min','25%','50%','75%'])
err_pct_desc = err_pct.abs().describe().T.drop(columns=['count','min','25%','50%','75%'])

def plot_diff(idl,gdl,err,err_pct,var):
    fig = plt.figure(1)
    fig.clf()
    ax1 = fig.add_subplot(211)
    err[var].plot(label='err', color='red', marker='.', ax=ax1, linewidth=2)
    ax1.set_ylim(ax1.get_ylim()[0]*1.3, ax1.get_ylim()[1])
    ax1.set_ylabel("Err [units]")
    ax1_pct = ax1.twinx()
    err_pct[var].plot(label='err', color='black', marker='.', ax=ax1_pct, linewidth=0.5)
    ax1_pct.set_ylabel("Err [%]")
    ax1.tick_params(axis='y', colors='red')
    ax1.yaxis.label.set_color('red')
    ax1.title.set_color('red')
    
    ax2 = fig.add_subplot(212, sharex=ax1)
    gdl[var].plot(label='GDL '+var, linewidth=3, ax=ax2, marker='.', markersize=4)
    idl[var].plot(label='IDL '+var, ax=ax2, marker='.', markersize=3)
    ax2.set_ylabel(var + " [units]")
    legend()


var = 'IceTemperature1(C)'
var = 'HeightStakes(m)'
var = 'ShortwaveRadiationDown(W/m2)'
# etc.

plot_diff(idl,gdl,err,err_pct,var)

desc = err_desc.round(3).astype("string")
desc = desc + " (" + err_pct_desc.replace(np.nan,0).round().astype(int).astype("string") + ")"
desc
#+END_SRC

#+RESULTS:
#+begin_example
                                        mean              max
DayOfYear                            0.0 (0)          0.0 (0)
DayOfCentury                         0.0 (0)          0.0 (0)
AirPressure(hPa)                   1.164 (1)   1968.41 (2216)
AirTemperature(C)                  0.593 (0)    1003.34 (223)
AirTemperatureHygroClip(C)         0.593 (0)    1003.35 (221)
RelativeHumidity(%)                0.633 (0)     1072.7 (264)
SpecificHumidity(g/kg)             0.593 (0)    1002.71 (225)
WindSpeed(m/s)                     0.594 (0)    1005.52 (227)
WindDirection(d)                   0.603 (0)     1029.0 (291)
SensibleHeatFlux(W/m2)             0.618 (0)     1063.4 (118)
LatentHeatFlux(W/m2)               0.584 (0)      989.7 (109)
ShortwaveRadiationDown(W/m2)       0.791 (0)     1578.0 (500)
ShortwaveRadiationDown_Cor(W/m2)   0.908 (0)     1568.6 (379)
ShortwaveRadiationUp(W/m2)         0.675 (0)     1241.2 (314)
ShortwaveRadiationUp_Cor(W/m2)     0.723 (0)     1241.2 (262)
Albedo_theta<70d                   0.318 (0)    999.442 (118)
LongwaveRadiationDown(W/m2)        0.751 (0)     1294.9 (407)
LongwaveRadiationUp(W/m2)           0.78 (0)     1320.0 (456)
CloudCover                         0.591 (0)      999.6 (224)
SurfaceTemperature(C)              0.591 (0)      999.0 (222)
HeightSensorBoom(m)                0.592 (0)   1001.634 (110)
HeightStakes(m)                      0.0 (0)          0.0 (0)
DepthPressureTransducer(m)         0.597 (0)   1010.179 (112)
DepthPressureTransducer_Cor(m)     0.598 (0)   1010.682 (112)
IceTemperature1(C)                   0.0 (0)          0.0 (0)
IceTemperature2(C)                 0.591 (0)    1000.47 (110)
IceTemperature3(C)                 0.592 (0)    1001.33 (110)
IceTemperature4(C)                 0.592 (0)    1002.95 (110)
IceTemperature5(C)                  0.59 (0)     998.03 (110)
IceTemperature6(C)                 0.586 (0)     991.77 (109)
IceTemperature7(C)                 0.584 (0)     987.53 (109)
IceTemperature8(C)                 0.582 (0)     983.72 (108)
TiltToEast(d)                       0.59 (0)     998.37 (110)
TiltToNorth(d)                      0.59 (0)     997.96 (110)
TimeGPS(hhmmssUTC)                42.107 (1)  131203.0 (2349)
LatitudeGPS(degN)                  0.638 (0)   1078.911 (120)
LongitudeGPS(degW)                 0.605 (0)   1023.082 (113)
ElevationGPS(m)                    0.807 (0)     1371.6 (157)
HorDilOfPrecGPS                    0.591 (0)     999.89 (110)
LoggerTemperature(C)               0.593 (0)    1004.05 (101)
FanCurrent(mA)                     0.671 (0)     1141.5 (128)
BatteryVoltage(V)                  0.599 (0)    1013.58 (112)
#+end_example


* Misc
** metadata.csv to TOML

Automatically generate v4 TOML files from the v3 metadata.csv files

#+BEGIN_SRC jupyter-python
import glob
import pandas as pd

mlist = glob.glob('./data/L0/metadata/*_metadata.csv')

rename = {'latitude_N(dd.ddddd)' : 'latitude',
          'longitude_W(dd.ddddd)' : 'longitude',
          'T_hygroclip_offset(C)' : 'hygroclip_t_offset',
          'SRin_calcoef' : 'dsr_eng_coef',
          'SRout_calcoef' : 'usr_eng_coef',
          'LRin_calcoef' : 'dlr_eng_coef',
          'LRout_calcoef' : 'ulr_eng_coef',
          'H_PT_calcoef' : 'pt_z_coef',
          'H_PT_p_cal' : 'pt_z_p_coef',
          'H_PT_factor' : 'pt_z_factor',
          'header_lines' : 'skiprows',
          'antifreeze_PT_(%)' : 'pt_antifreeze',
          'rotation_ini(deg)' : 'boom_azimuth',
          'col_minute_of_year' : 'min_y',
          'col_p' : 'p',
          'col_T' : 't_1',
          'col_T_hygroclip' : 't_2',
          'col_RH' : 'rh',
          'col_WS' : 'wspd',
          'col_WD' : 'wdir',
          'col_WD_sd' : 'wd_std',
          'col_SRin' : 'dsr',
          'col_SRout' : 'usr',
          'col_LRin' : 'dlr',
          'col_LRout' : 'ulr',
          'col_T_rad' : 't_rad',
          'col_H_aws' : 'z_boom',
          'col_qual_H_aws' : 'z_boom_q',
          'col_H_stk' : 'z_stake',
          'col_qual_H_stk' : 'z_stake_q',
          'col_H_pt' : 'z_pt',
          'col_Tice1' : 't_i_1',
          'col_Tice2' : 't_i_2',
          'col_Tice3' : 't_i_3',
          'col_Tice4' : 't_i_4',
          'col_Tice5' : 't_i_5',
          'col_Tice6' : 't_i_6',
          'col_Tice7' : 't_i_7',
          'col_Tice8' : 't_i_8',
          'col_ornt' : 'ORIENTATION',
          'col_tiltX' : 'tilt_x',
          'col_tiltY' : 'tilt_y',
          'col_GPStime' : 'gps_time',
          'col_GPSlat' : 'gps_lat',
          'col_GPSlon' : 'gps_lon',
          'col_GPSelev' : 'gps_alt',
          'col_GPSgeoid' : 'gps_geoid',
          'col_GPSqual' : 'gps_q',
          'col_GPSnumsats' : 'gps_numsats',
          'col_GPShdop' : 'gps_hdop',
          'col_Tlog' : 't_log',
          'col_Ifan' : 'fan_dc',
          'col_Vbat_ini' : 'batt_v_ss',
          'col_Vbat' : 'batt_v',
          'col_season' : 'SEASON'}


for md in mlist:
    df = pd.read_csv(md, index_col=0).rename(columns=rename)

    station = '_'.join(md.split("/")[-1].split("_")[:-1])
    out_file = open('./data/L0/config/' + station + '.toml', 'w')
    print(f"station_id = '{station}'", file=out_file)
    print("nodata     = ['-999', 'NAN'] # if one is a string, all must be strings\n", file=out_file)
          
    for f in df['filename']:
        ddf = df[df['filename'] == f].T
        if len(ddf.loc['filename']) == 0: continue
        if ddf.loc['filename'].values[0][-4:] != ".txt": continue

        print("['{}']".format(ddf.loc['filename'].values[0]), file=out_file)
        if 'transmitted' in str(ddf.loc['filename']):
            print("format     = 'TX'", file=out_file)
        elif 'SlimTable' in str(ddf.loc['filename']):
            print("format     = 'STM'", file=out_file)
        else:
            print("format     = 'raw'", file=out_file)

        for n in ['skiprows', 'latitude', 'longitude', 'hygroclip_t_offset', 'dsr_eng_coef', 'usr_eng_coef', 'dlr_eng_coef', 'ulr_eng_coef', 'pt_z_coef', 'pt_z_p_coef', 'pt_z_factor', 'pt_antifreeze', 'boom_azimuth']:
            print(n +  ' = {}'.format(np.round(ddf.loc[n].values[0],4)), file=out_file)

        cols = ddf.loc[['min_y','p', 't_1', 't_2', 'rh', 'wspd', 'wdir', 'wd_std', 'dsr', 'usr', 'dlr', 'ulr', 't_rad',
                        'z_boom', 'z_boom_q', 'z_stake', 'z_stake_q', 'z_pt', 't_i_1', 't_i_2', 't_i_3', 't_i_4',
                        't_i_5', 't_i_6', 't_i_7', 't_i_8', 'ORIENTATION', 'tilt_x', 'tilt_y', 'gps_time',
                        'gps_lat', 'gps_lon', 'gps_alt', 'gps_geoid', 'gps_q', 'gps_numsats', 'gps_hdop', 't_log',
                        'fan_dc', 'batt_v_ss', 'batt_v', 'SEASON']]
        cols.loc['rec'] = 2
        cols.loc['time'] = 1
        cols.columns = ['col']
        for i in np.arange(int(cols.max())):
            if i not in cols['col'].values:
                cols.loc['SKIP_' + str(i)] = i
        cols = cols.sort_values(by='col').replace(0,np.nan).dropna()
        print('columns = {}'.format(np.array2string(cols.index.values, separator=',', max_line_width=60)), file=out_file)
            
        # print('latitude   = {}'.format(str(ddf.loc['latitude'].values[0])), file=out_file)
        # print('longitude  = {}'.format(-ddf.loc['longitude'].values[0]), file=out_file)
        print('\n', file=out_file)
    out_file.close()

ddf    
#+END_SRC

#+RESULTS:
|                    |                              9 |
|--------------------+--------------------------------|
| filename           | TAS_A_2020_raw_transmitted.txt |
| slimtablemem?      |                             no |
| transmitted?       |                            yes |
| skiprows           |                              0 |
| data_lines         |                            884 |
| columns            |                             38 |
| year start         |                           2019 |
| latitude           |                          65.78 |
| longitude          |                           38.9 |
| UTC_offset(h)      |                              0 |
| hygroclip_t_offset |                              0 |
| dsr_eng_coef       |                          14.15 |
| usr_eng_coef       |                          12.97 |
| dlr_eng_coef       |                          10.23 |
| ulr_eng_coef       |                          13.47 |
| pt_z_coef          |                          0.407 |
| pt_z_p_coef        |                          982.1 |
| pt_z_factor        |                            2.5 |
| pt_antifreeze      |                             50 |
| boom_azimuth       |                              0 |
| col_datetime       |                              1 |
| col_date           |                              0 |
| col_year           |                              0 |
| col_month          |                              0 |
| col_day            |                              0 |
| col_day_of_year    |                              0 |
| col_time           |                              0 |
| col_hour           |                              0 |
| col_minute         |                              0 |
| min_y              |                              0 |
| p                  |                              3 |
| t_1                |                              4 |
| t_2                |                              5 |
| rh                 |                              6 |
| wspd               |                              7 |
| wdir               |                              8 |
| wd_std             |                              0 |
| dsr                |                              9 |
| usr                |                             10 |
| dlr                |                             11 |
| ulr                |                             12 |
| t_rad              |                             13 |
| z_boom             |                             14 |
| z_boom_q           |                              0 |
| z_stake            |                             15 |
| z_stake_q          |                              0 |
| z_pt               |                             16 |
| t_i_1              |                             17 |
| t_i_2              |                             18 |
| t_i_3              |                             19 |
| t_i_4              |                             20 |
| t_i_5              |                             21 |
| t_i_6              |                             22 |
| t_i_7              |                             23 |
| t_i_8              |                             24 |
| ORIENTATION        |                              0 |
| tilt_x             |                             25 |
| tilt_y             |                             26 |
| gps_time           |                             27 |
| gps_lat            |                             28 |
| gps_lon            |                             29 |
| gps_alt            |                             30 |
| gps_geoid          |                              0 |
| gps_q              |                              0 |
| gps_numsats        |                              0 |
| gps_hdop           |                             31 |
| t_log              |                              0 |
| fan_dc             |                             32 |
| batt_v_ss          |                              0 |
| batt_v             |                             33 |
| SEASON             |                              0 |

